cask "alt-tab"                 # Windows-style app switcher for macOS
cask "tailscale"              # Zero-config VPN using WireGuard — private networks made easy
cask "chatgpt"                # Official ChatGPT desktop app
cask "figma"                  # Collaborative interface design tool (UI/UX)
cask "brave-browser"          # Privacy-focused web browser with built-in ad blocker
cask "visual-studio-code"     # Lightweight but powerful code editor from Microsoft
cask "vlc"                    # Versatile open-source media player (supports nearly all formats)
cask "wifiman"                # Network scanner and speed test app by Ubiquiti
cask "spotify"                # Popular music streaming app
cask "postman"                # API development and testing platform
cask "google-drive"           # File sync and backup client for Google Drive
cask "messenger"              # Facebook Messenger desktop app
cask "logi-options-plus"      # Logitech device configuration software
cask "google-chrome"          # Fast, popular web browser by Google
cask "loop"                   # Window manager for macOS with keyboard-first workflows
cask "microsoft-office"       # Microsoft Office 365
